# 2.6 Στην Intracom ο διευθυντής αποφάσισε να δώσει πριμ παραγωγικότητας στους υπαλλήλους της εταιρίας βάσει της απόδοσής τους,
# όπως αυτή αξιολογήθηκε από τους προϊσταμένους τους. Η απόδοση αξιολογείται και βαθμολογείται στην κλίμακα 1-100, με
# το 1 να θεωρείται η χαμηλότερη αξιολόγηση και το 100 η υψηλότερη. Το πριμ που ανακοίνωσε είναι το ακόλουθο:

# Αξιολόγηση            Πριμ (Ποσοστό επί του μισθού)
# Πάνω από 80                         10%
# Πάνω από 90                         15%
# Πάνω από 95                         20%

# Το τμήμα πληροφορικής έφτιαξε έναν κώδικα σύμφωνα με το οποίο θα δίνεται ο μισθός και η αξιολόγηση του υπαλλήλου και θα του εμφανίζει το πριμ που θα πάρει και τις συνολικές του αποδοχές. [3.10]


incomes = float(input("Incomes: "))
review = int(input("Review points: "))

prim = 0
if review > 95:
    prim = incomes * 0.2
elif review > 90:
    prim = incomes * 0.15
elif review > 80:
    prim = incomes * 0.1

print("Prim (in eur): " + prim)
print("Total incomes (in eur): " + prim + incomes)
