# 2.3 Η μισθοδοσία μιας εταιρίας πραγματοποιείται με χαρτονομίσματα των 50€, 20€, των 10€, 5€ και κέρματα του 1€.
# Να γράψετε πρόγραμμα που να διαβάζει το ακέραιο ποσό μισθοδοσίας και να εκτυπώνει πόσα
# χαρτονομίσματα ή κέρματα από την κάθε κατηγορία απαιτούνται. [2.10]


monthly_payment = int(input("Δώστε την ακέραια μισθοδοσία του υπαλλήλου: "))

print("50€: ", monthly_payment // 50)
print("20€: ", monthly_payment % 50 // 20)
print("10€: ", monthly_payment % 50 % 20 // 10)
print("5€: ", monthly_payment % 50 % 20 % 10 // 5)
print("1€: ", monthly_payment % 50 % 20 % 10 % 5)
