# 2.5 Ένα οχηματαγωγό πλοίο μεταφέρει μόνο φορτηγά και λεωφορεία και η χρέωση κάθε μεταφοράς προκύπτει με τον παρακάτω τρόπο:

#     - Υπολογίζεται το μήκος του οχήματος (π.χ. 3.4 μέτρα), έπειτα στρογγυλοποιείται στον πλησιέστερο ακέραιο (π.χ. 3 μέτρα)
#       και η χρέωση είναι 5€ ανά μέτρο για τα οχήματα τύπου “Φορτηγό” και 4€ ανά μέτρο για τα “Λεωφορεία”.
#     - Αν ο οδηγός επιλέξει τη θέση “Σαλόνι”, πληρώνει ένα εισιτήριο αξίας 15€, ενώ αν επιλέξει θέση τύπου “Κατάστρωμα” πληρώνει 10€.
#     - Υπολογίζεται το άθροισμα των παραπάνω χρεώσεων.
#     - Αν η τελική χρέωση ξεπεράσει τα 50€ τότε υπάρχει μια έκπτωση 10% στο υπερβαίνων ποσό.
#     - Στο τελικό ποσό προστίθεται ΦΠΑ 24%

# Να γραφεί πρόγραμμα που να υλοποιεί την παραπάνω λογική για την έκδοση ενός εισιτηρίου και του κόστους του. [3.6]


vehicle_length = float(
    input("Δώσε το μήκος του οχήματος (σε δεκαδικό ή ακέραιο αριθμό): ")
)
vehicle_type = input("Τύπος οχήματος (Φορτηγό/Λεωφορείο): ")
driver_seat = input("Θέση οδηγού (Σαλόνι/Κατάστρωμα): ")

vehicle_length = round(vehicle_length, 0)

total = 0

if vehicle_type == "Φορτηγό":
    total = vehicle_length * 5
else:
    total = vehicle_length * 4

if driver_seat == "Σαλόνι":
    total += 15
else:
    total += 10


if total > 50:
    total *= 0.9


print("Total: " + total * 1.24)
