# 2.4 Το αυτοκίνητο της οικογένειάς σας υπόκειται σε μικρό service (αλλαγή λαδιών) στα 10.000, 30.000, 50.000 κ.ο.κ.
# χιλιόμετρα και σε μεγάλο service στα 20.000, 40.000, 60.000 κ.ο.κ. Να γράψετε πρόγραμμα που να
# διαβάζει την ακέραια χιλιομετρική ένδειξη του αυτοκινήτου σας και να εμφανίζει σε πόσα χιλιόμετρα
# θα πραγματοποιηθεί το επόμενο service και τι είδους θα είναι αυτό (μικρό/μεγάλο). [3.5]


kilometers = int(input("Δώσε τα χιλιόμετρα του αυτοκινήτου: "))


next_service_category = (kilometers // 10000 + 1) * 10000

difference = next_service_category - kilometers

print("Το επόμενο service θα γίνει σε " + difference + " χιλιόμετρα")


category = "Μικρό"
if next_service_category % 20000 == 0:
    category = "Μεγάλο"

print("Το επόμενο service θα είναι '" + category + "'")
